Repository: Anonymous751/Django-Ecomm-99
Catalog: dj_b_ecomm_project/locale/*/LC_MESSAGES/django.po
Languages: pa

source: Email
pa: ਈਮੇਲ

source: Enter a valid email address.
pa: ਇੱਕ ਵੈਧ ਈਮੇਲ ਪਤਾ ਦਰਜ ਕਰੋ।

source: Profile Image
pa: ਪ੍ਰੋਫਾਈਲ ਚਿੱਤਰ

source: Optional: Upload a profile image.
pa: ਵਿਕਲਪਿਕ: ਇੱਕ ਪ੍ਰੋਫਾਈਲ ਚਿੱਤਰ ਅੱਪਲੋਡ ਕਰੋ।

source: Username
pa: ਉਪਭੋਗਤਾ ਨਾਮ

source: Password
pa: ਪਾਸਵਰਡ

source: Choose a unique username.
pa: ਇੱਕ ਵਿਲੱਖਣ ਉਪਭੋਗਤਾ ਨਾਮ ਚੁਣੋ।

source: Your password must contain at least 8 characters.
pa: ਤੁਹਾਡੇ ਪਾਸਵਰਡ ਵਿੱਚ ਘੱਟੋ-ਘੱਟ 8 ਅੱਖਰ ਹੋਣੇ ਚਾਹੀਦੇ ਹਨ।

source: Enter the same password again for confirmation.
pa: ਪੁਸ਼ਟੀ ਲਈ ਉਹੀ ਪਾਸਵਰਡ ਦੁਬਾਰਾ ਦਰਜ ਕਰੋ।

source: Settings / ShopEase
pa: ਸੈਟਿੰਗਾਂ / ਖਰੀਦਾਰੀ ਆਸਾਨ

source: Settings
pa: ਸੈਟਿੰਗਾਂ

source: Profile
pa: ਪ੍ਰੋਫਾਈਲ

source: Account Preferences
pa: ਖਾਤਾ ਤਰਜੀਹਾਂ

source: Privacy & Security
pa: ਗੋਪਨੀਯਤਾ ਅਤੇ ਸੁਰੱਖਿਆ

source: App Settings
pa: ਐਪ ਸੈਟਿੰਗਾਂ

source: Profile Settings
pa: ਪ੍ਰੋਫਾਈਲ ਸੈਟਿੰਗਾਂ

source: Default Profile
pa: ਪੂਰਵ-ਨਿਰਧਾਰਤ ਪ੍ਰੋਫਾਈਲ

source: Change Photo
pa: ਫੋਟੋ ਬਦਲੋ

source: First Name
pa: ਪਹਿਲਾ ਨਾਂ

source: Last Name
pa: ਆਖਰੀ ਨਾਂਮ

source: Change Password
pa: ਪਾਸਵਰਡ ਬਦਲੋ

source: Current Password
pa: ਵਰਤਮਾਨ ਪਾਸਵਰਡ

source: Enter your current password
pa: ਆਪਣਾ ਮੌਜੂਦਾ ਪਾਸਵਰਡ ਦਰਜ ਕਰੋ

source: New Password
pa: ਨਵਾਂ ਪਾਸਵਰਡ

source: Enter new password
pa: ਨਵਾਂ ਪਾਸਵਰਡ ਦਰਜ ਕਰੋ

source: Confirm New Password
pa: ਨਵੇਂ ਪਾਸਵਰਡ ਦੀ ਪੁਸ਼ਟੀ ਕਰੋ

source: Confirm new password
pa: ਨਵੇਂ ਪਾਸਵਰਡ ਦੀ ਪੁਸ਼ਟੀ ਕਰੋ

source: Save Changes
pa: ਤਬਦੀਲੀਆਂ ਨੂੰ ਸੁਰੱਖਿਅਤ ਕਰੋ

source: Language
pa: ਭਾਸ਼ਾ

source: Timezone
pa: ਸਮਾਂ ਖੇਤਰ

source: Two-Factor Authentication (2FA)
pa: ਦੋ-ਕਾਰਕ ਪ੍ਰਮਾਣਿਕਤਾ (2FA)

source: Add an extra layer of security to your account.
pa: ਆਪਣੇ ਖਾਤੇ ਵਿੱਚ ਸੁਰੱਖਿਆ ਦੀ ਇੱਕ ਵਾਧੂ ਪਰਤ ਸ਼ਾਮਲ ਕਰੋ।

source: Disable 2FA
pa: 2FA ਨੂੰ ਅਸਮਰੱਥ ਬਣਾਓ

source: Enable 2FA
pa: 2FA ਨੂੰ ਸਮਰੱਥ ਬਣਾਓ

source: Manage Blocked Users
pa: ਬਲੌਕ ਕੀਤੇ ਉਪਭੋਗਤਾਵਾਂ ਦਾ ਪ੍ਰਬੰਧਨ ਕਰੋ

source: -- Choose a User --
pa: -- ਇੱਕ ਉਪਭੋਗਤਾ ਚੁਣੋ --

source: Block
pa: ਬਲਾਕ

source: Unblock
pa: ਅਨਬਲੌਕ ਕਰੋ

source: Privacy Settings
pa: ਗੋਪਨੀਯਤਾ ਸੈਟਿੰਗਾਂ

source: Make my account private
pa: ਮੇਰੇ ਖਾਤੇ ਨੂੰ ਨਿੱਜੀ ਬਣਾਓ

source: Make Account Private
pa: ਖਾਤੇ ਨੂੰ ਨਿੱਜੀ ਬਣਾਓ

source: Dark Mode
pa: ਡਾਰਕ ਮੋਡ

source: Dashboard Analytics
pa: ਡੈਸ਼ਬੋਰਡ ਵਿਸ਼ਲੇਸ਼ਣ

source: Basic
pa: ਮੂਲ

source: Advanced
pa: ਉੱਨਤ

source: Professional
pa: ਪੇਸ਼ੇਵਰ

source: Welcome,
pa: ਜੀ ਆਇਆਂ ਨੂੰ,

source: Manage your account, track orders, and explore analytics all in one place.
pa: ਆਪਣੇ ਖਾਤੇ ਦਾ ਪ੍ਰਬੰਧਨ ਕਰੋ, ਆਰਡਰਾਂ ਨੂੰ ਟ੍ਰੈਕ ਕਰੋ, ਅਤੇ ਵਿਸ਼ਲੇਸ਼ਣ ਦੀ ਪੜਚੋਲ ਕਰੋ, ਸਭ ਕੁਝ ਇੱਕੋ ਥਾਂ 'ਤੇ ਕਰੋ।

source: My Profile
pa: ਮੇਰੀ ਪ੍ਰੋਫ਼ਾਈਲ

source: Orders
pa: ਆਰਡਰ

source: Check your past and current orders, track shipments, and manage returns.
pa: ਆਪਣੇ ਪਿਛਲੇ ਅਤੇ ਮੌਜੂਦਾ ਆਰਡਰਾਂ ਦੀ ਜਾਂਚ ਕਰੋ, ਸ਼ਿਪਮੈਂਟਾਂ ਨੂੰ ਟ੍ਰੈਕ ਕਰੋ ਅਤੇ ਰਿਟਰਨਾਂ ਦਾ ਪ੍ਰਬੰਧਨ ਕਰੋ।

source: View Orders
pa: ਆਰਡਰ

source: Settings Image
pa: ਸੈਟਿੰਗਾਂ

source: Account Settings
pa: ਐਪ ਸੈਟਿੰਗਾਂ

source: Update personal info, change password, or manage privacy preferences.
pa: ਨਿੱਜੀ ਜਾਣਕਾਰੀ ਅੱਪਡੇਟ ਕਰੋ, ਪਾਸਵਰਡ ਬਦਲੋ, ਜਾਂ ਗੋਪਨੀਯਤਾ ਤਰਜੀਹਾਂ ਦਾ ਪ੍ਰਬੰਧਨ ਕਰੋ।

source: Go to Settings
pa: ਸੈਟਿੰਗਾਂ

source: Forgot Password
pa: ਵਰਤਮਾਨ ਪਾਸਵਰਡ

source: Enter your registered email to receive OTP.
pa: OTP ਪ੍ਰਾਪਤ ਕਰਨ ਲਈ ਆਪਣੀ ਰਜਿਸਟਰਡ ਈਮੇਲ ਦਰਜ ਕਰੋ।

source: Registered Email
pa: ਰਜਿਸਟਰ ਕਰੋ

source: Send OTP
pa: OTP ਭੇਜੋ

source: Dashboard
pa: ਡੈਸ਼ਬੋਰਡ

source: Products
pa: ਉਤਪਾਦ

source: Login
pa: ਲਾਗਿਨ

source: Logout
pa: ਲਾਗਆਉਟ

source: Welcome back! Please login to your account.
pa: ਵਾਪਸ ਸੁਆਗਤ ਹੈ! ਕਿਰਪਾ ਕਰਕੇ ਆਪਣੇ ਖਾਤੇ ਵਿੱਚ ਲੌਗਇਨ ਕਰੋ।

source: Forgot Password?
pa: ਵਰਤਮਾਨ ਪਾਸਵਰਡ

source: Don't have an account?
pa: ਕੀ ਤੁਹਾਡਾ ਖਾਤਾ ਨਹੀਂ ਹੈ?

source: Register
pa: ਰਜਿਸਟਰ ਕਰੋ

source: OR
pa: ਜਾਂ

source: Login with Google
pa: ਗੂਗਲ ਨਾਲ ਲੌਗਇਨ ਕਰੋ

source: Login with Facebook
pa: ਫੇਸਬੁੱਕ ਨਾਲ ਲੌਗਇਨ ਕਰੋ

source: Login with GitHub
pa: ਇੰਸਟਾਗ੍ਰਾਮ ਨਾਲ ਲੌਗਇਨ ਕਰੋ

source: Login with Instagram
pa: ਗਿਟਹੱਬ ਨਾਲ ਲੌਗਇਨ ਕਰੋ

source: Create Account
pa: ਖਾਤਾ ਬਣਾਓ

source: Name
pa: ਆਖਰੀ ਨਾਂਮ

source: Message
pa: ਸੁਨੇਹਾ

source: My Orders / ShopEase
pa: ਸੈਟਿੰਗਾਂ / ਖਰੀਦਾਰੀ ਆਸਾਨ

source: My Orders
pa: ਆਰਡਰ

source: View all your past and recent purchases in one place.
pa: ਆਪਣੀਆਂ ਸਾਰੀਆਂ ਪਿਛਲੀਆਂ ਅਤੇ ਹਾਲੀਆ ਖਰੀਦਾਂ ਨੂੰ ਇੱਕ ਥਾਂ 'ਤੇ ਦੇਖੋ।

source: Order
pa: ਆਰਡਰ

source: Pending
pa: ਬਕਾਇਆ

source: Delivered
pa: ਡਿਲੀਵਰ ਕੀਤਾ

source: Cancelled
pa: ਰੱਦ ਕਰ ਦਿੱਤਾ

source: Qty
pa: ਮਾਤਰਾ

source: View Products
pa: ਉਤਪਾਦ

source: Update Ordered Product
pa: ਉਤਪਾਦ

source: Delete Order
pa: ਆਰਡਰ

source: Order Total
pa: ਕੁੱਲ

source: No Orders
pa: ਆਰਡਰ

source: No orders found.
pa: ਕੋਈ ਆਰਡਰ ਨਹੀਂ ਮਿਲੇ।

source: Action completed successfully!
pa: ਕਾਰਵਾਈ ਸਫਲਤਾਪੂਰਵਕ ਪੂਰੀ ਹੋਈ!

source: Close
pa: ਬੰਦ ਕਰੋ

source: Electronics
pa: ਇਲੈਕਟ੍ਰਾਨਿਕਸ

source: Tech
pa: ਤਕਨੀਕੀ

source: Sports
pa: ਖੇਡਾਂ

source: Fashion
pa: ਫੈਸ਼ਨ

source: Home & Kitchen
pa: ਘਰ ਅਤੇ ਰਸੋਈ

source: Explore all categories and discover amazing items.
pa: ਸਾਰੀਆਂ ਸ਼੍ਰੇਣੀਆਂ ਦੀ ਪੜਚੋਲ ਕਰੋ ਅਤੇ ਸ਼ਾਨਦਾਰ ਚੀਜ਼ਾਂ ਦੀ ਖੋਜ ਕਰੋ।

source: Create Product
pa: ਉਤਪਾਦ

source: Trending
pa: ਬਕਾਇਆ

source: View Details
pa: ਆਰਡਰ

source: Update
pa: ਅੱਪਡੇਟ ਕਰੋ

source: Are you sure you want to delete this product?
pa: ਕੀ ਤੁਸੀਂ ਯਕੀਨੀ ਤੌਰ 'ਤੇ ਇਸ ਉਤਪਾਦ ਨੂੰ ਮਿਟਾਉਣਾ ਚਾਹੁੰਦੇ ਹੋ?

source: English
pa: ਅੰਗਰੇਜ਼ੀ

source: French
pa: ਫ੍ਰੈਂਚ

source: Hindi
pa: ਹਿੰਦੀ

source: Punjabi
pa: ਪੰਜਾਬੀ

source: About
pa: ਬਾਰੇ

source: About ShopEase
pa: ਖਰੀਦਾਰੀ ਆਸਾਨ ਬਾਰੇ

source: Welcome to <strong>ShopEase</strong> — your one-stop destination for smart, easy, and enjoyable online shopping!<br><br> We aim to bring you the best deals, top-quality products, and a seamless shopping experience from the comfort of your home.<br><br> Built with ❤️ using Django and Bootstrap.
pa: <strong>ਖਰੀਦਾਰੀ ਆਸਾਨ</strong> ਵਿੱਚ ਤੁਹਾਡਾ ਸੁਆਗਤ ਹੈ — ਸਮਾਰਟ, ਆਸਾਨ, ਅਤੇ ਆਨੰਦਦਾਇਕ ਔਨਲਾਈਨ ਖਰੀਦਦਾਰੀ ਲਈ ਤੁਹਾਡੀ ਇੱਕ-ਸਟਾਪ ਮੰਜ਼ਿਲ!<br><br> ਸਾਡਾ ਉਦੇਸ਼ ਤੁਹਾਡੇ ਲਈ ਸਭ ਤੋਂ ਵਧੀਆ ਸੌਦੇ, ਉੱਚ-ਗੁਣਵੱਤਾ ਵਾਲੇ ਉਤਪਾਦ, ਅਤੇ ਤੁਹਾਡੇ ਘਰ ਦੇ ਆਰਾਮ ਤੋਂ ਇੱਕ ਸਹਿਜ ਖਰੀਦਦਾਰੀ ਅਨੁਭਵ ਲਿਆਉਣਾ ਹੈ।<br><br> Django ਅਤੇ Bootstrap ਦੀ ਵਰਤੋਂ ਕਰਕੇ ❤️ ਨਾਲ ਬਣਾਇਆ ਗਿਆ ਹੈ।

source: Your Cart
pa: ਕਾਰਟ

source: Price
pa: ਕੀਮਤ

source: Your cart is empty!
pa: ਤੁਹਾਡੀ ਕਾਰਟ ਖਾਲੀ ਹੈ!

source: Total
pa: ਕੁੱਲ

source: Continue Shopping
pa: ਖਰੀਦਾਰੀ ਜਾਰੀ ਰੱਖੋ

source: Checkout
pa: ਭੁਗਤਾਨ ਕਰੋ

source: Image
pa: ਚਿੱਤਰ

source: Quantity
pa: ਮਾਤਰਾ

source: Add to Cart
pa: ਕਾਰਟ ਵਿੱਚ ਸ਼ਾਮਲ ਕਰੋ

source: Contact Us
pa: ਸੰਪਰਕ ਕਰੋ

source: Your message has been sent successfully!
pa: ਤੁਹਾਡਾ ਸੁਨੇਹਾ ਸਫਲਤਾਪੂਰਵਕ ਭੇਜਿਆ ਗਿਆ ਹੈ!

source: Send Message
pa: ਸੁਨੇਹਾ ਭੇਜੋ

source: ShopEase
pa: ਖਰੀਦਾਰੀ ਆਸਾਨ

source: Your one-stop e-commerce destination for premium products, seamless shopping, and a smarter lifestyle.
pa: ਪ੍ਰੀਮੀਅਮ ਉਤਪਾਦਾਂ, ਸਹਿਜ ਖਰੀਦਦਾਰੀ, ਅਤੇ ਇੱਕ ਚੁਸਤ ਜੀਵਨ ਸ਼ੈਲੀ ਲਈ ਤੁਹਾਡਾ ਇੱਕ-ਸਟਾਪ ਈ-ਕਾਮਰਸ ਮੰਜ਼ਿਲ।

source: Useful Links
pa: ਉਪਯੋਗੀ ਲਿੰਕ

source: Home
pa: ਘਰ

source: Cart
pa: ਕਾਰਟ

source: Follow Us
pa: ਸਾਡੇ ਪਿਛੇ ਆਓ

source: All Rights Reserved.
pa: ਸਾਰੇ ਹੱਕ ਰਾਖਵੇਂ ਹਨ.

source: Welcome to ShopEase
pa: ਖਰੀਦਾਰੀ ਆਸਾਨ ਬਾਰੇ

source: Discover amazing products at unbeatable prices!
pa: ਅਜੇਤੂ ਕੀਮਤਾਂ 'ਤੇ ਸ਼ਾਨਦਾਰ ਉਤਪਾਦਾਂ ਦੀ ਖੋਜ ਕਰੋ!

source: Shop Now
pa: ਹੁਣੇ ਖਰੀਦੋ

source: Featured Products
pa: ਉਤਪਾਦ

source: Filter by Category:
pa: ਸ਼੍ਰੇਣੀ ਮੁਤਾਬਕ ਫਿਲਟਰ ਕਰੋ:

source: All
pa: ਸਾਰੇ

source: Trending Products
pa: ਰੁਝਾਨ ਵਿਚ

source: New Comers
pa: ਨਵੇਂ ਆਉਣ ਵਾਲੇ

source: Toggle navigation
pa: ਨੈਵੀਗੇਸ਼ਨ ਨੂੰ ਟੌਗਲ ਕਰੋ

source: Contact
pa: ਸੰਪਰਕ ਕਰੋ

source: Search product by name & category...
pa: ਨਾਮ ਅਤੇ ਸ਼੍ਰੇਣੀ ਦੁਆਰਾ ਉਤਪਾਦ ਖੋਜੋ...

source: Search
pa: ਖੋਜ

source: unique items in cart
pa: ਕਾਰਟ ਵਿੱਚ ਵਿਲੱਖਣ ਆਈਟਮਾਂ

source: Account
pa: ਖਾਤਾ
